### [여러 개의 컬럼 값 합치기](https://computer-science-student.tistory.com/236)

In [6]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'이름':['유재석','강호동','신동엽','이경규'],
                   '시간':[1,3,5,7],
                   '분':[5, 40, 35, 57]})
df

    이름  시간   분
0  유재석   1   5
1  강호동   3  40
2  신동엽   5  35
3  이경규   7  57

In [8]:
cols = ['시간', '분']
df['시간_분_combined'] =df[cols].apply(lambda row: ':'.join(row.values.astype(str)), axis=1)
df

    이름  시간   분 시간_분_combined
0  유재석   1   5           1:5
1  강호동   3  40          3:40
2  신동엽   5  35          5:35
3  이경규   7  57          7:57